

// 使用 Mock
var Mock = require('mockjs');
var data = Mock.mock(	
    {
    "status": "0000",
    "message": "操作成功",
    "data": {
        pageList:[
            {
                annYldRat: "0.00",
                bgnDt: "2019-01-30",
                managerBackground: "毕业于清华大学金融学专业，硕士研究生学历，具有基金从业资格，证券从业年限5年。2013年7月至2014年10月曾任职于中信建投基金管理有限公司交易员。2014年11月至2017年5月曾任职于泰康资产管理有限公司固定收益交易高级经理。2017年6月加入中融基金管理有限公司，现任固收投资部基金经理。2019年1月起任中融融裕双利债券型证券投资基金、中融货币市场基金、中融日日盈交易型货币市场基金、中融融信双盈债券型证券投资基金、中融上海清算所银行间3-5年中高等级信用债指数发起式证券投资基金、中融上海清算所银行间0-1年中高等级信用债指数发起式证券投资基金、中融上海清算所银行间1-3年高等级信用债指数发起式证券投资基金、中融上海清算所银行间1-3年中高等级信用债指数发起式证券投资基金基金经理。2019年4月起担任中融鑫价值灵活配置混合型证券投资基金、中融鑫思路灵活配置混合型证券投资基金基金经理。2019年5月起担任中融聚业3个月定期开放债券型发起式证券投资基金、中融稳健添利债券型证券投资基金基金经理。2019年9月起任中融聚汇3个月定期开放债券型发起式证券投资基金基金经理。",
                managerEducation: "硕士",
                managerId: "7BE1E9",
                managerName: "朱柏蓉",
                publishDate: "2019-02-01",
                secuNum: "24",
                workYears: 0,
            },{
                annYldRat: "2.19",
                bgnDt: "2014-10-21",
                managerBackground: "对外经济贸易大学金融学学士，2007年7月至2014年7月曾任银华基金管理有限公司交易部管理员，固定收益部基金助理。2014年7月加入中融基金管理有限公司，现在固定收益投资部工作。2014年10月起任中融货币市场基金基金经理。2015年10月至2019年9月任中融融安二号保本混合型证券投资基金(2018年9月转型为中融融安二号灵活配置混合型证券投资基金)基金经理。2015年11月至2017年6月任中融日日盈交易型货币市场基金的基金经理.2016年8月起至2018年12月任中融融丰纯债债券型证券投资基金基金经理。2016年12月起担任中融恒泰纯债债券型证券投资基金基金经理。2017年2月起任中融增鑫一年定期开放债券型证券投资基金基金经理。2017年7月至2019年5月担任中融盈泽债券型证券投资基金基金经理。2017年7月至2017年10月担任中融盈润债券型证券投资基金基金经理。2017年8月至2019年5月担任中融恒信纯债债券型证券投资基金基金经理。2017年8月起任中融现金增利货币市场基金基金经理。2018年3月起任中融聚商3个月定期开放债券型发起式证券投资基金基金经理。2018年3月至2019年5月担任中融季季红定期开放债券型证券投资基金基金经理。2018年6月至2019年9月担任中融日日盈交易型货币市场基金基金经理。2017年10月至2018年6月担任中融睿丰一年定期开放债券型证券投资基金基金经理。2018年9月起任中融聚安3个月定期开放债券型发起式证券投资基金基金经理。2018年9月至2019年9月任中融鑫起点灵活配置混合型证券投资基金基金经理。2017年8月至2019年5月担任中融睿祥一年定期开放债券型证券投资基金基金经理。2019年11月起任中融睿嘉39个月定期开放债券型证券投资基金基金经理。",
                managerEducation: "本科",
                managerId: "794399",
                managerName: "李倩",
                publishDate: "2014-10-22",
                secuNum: "13",
                workYears: 5,
            }
        ]
    }
    });

module.exports = data;