/*
个人数据   接口模拟

*/

console.log(124);

// 使用 Mock
var Mock = require('mockjs');


//开始造假数据…………………………………………………………………………………………………………………………………………………………


//1. 接口数据
var data = Mock.mock({
  "hmac": "hmac",
  "status": 0,
  "code": "",//CF0004
  "msg": "处理成功！",
  'data':{ 
			"name":"张三",//用户名，未认证则显示加*手机号
			'accountType|1':["1","0"],//客户类型【0.机构 1.个人】
			'idnoCheckflag|1':["2"],//是否已实名认证【1.否 2.是】   是否实名认证 0-否 1-是
			'isBindPhone|1':["1","2"],//是否已绑定手机号【1.否 2.是】
			'isRiskAppraisal|1':["1","2"],//是否已风险测评【1.否 2.是】
			"identityType|1": ["0","1","2","3","4","5","6","7","8","9","A","B","C","D"],//证件类型【参照备注】
			"identityTypeDesc|1": ["0","1","2","3","4","5","6","7","8","9","A","B","C","D"],//证件类型翻译【参照备注】
			'identityNo|1':["15210****0000000000","12340****000444"],//证件号【加*】
			'email|1':["2222@124.com","234234234@ee.com"],//邮箱地址
			'phone|1':["111****111",'33****4555'],//联系人手机号【加*】
			'address|1':["sdfsdfsf未发生大幅度",'撒打发斯蒂芬事发地点时发的发斯蒂芬阿斯蒂芬',"asdfasdfsdf是法师打发斯蒂芬"],//联系地址
			'investFavour|1':["1","2","3","4","5"],//投资偏好【参照备注】
			//'qualifyStatus|1':["0","1","2","3","4","5"],//审核状态【参照备注】
			//'qualifyReason|1':['审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因审核驳回原因'], //审核驳回原因
			"orgContractName|1": ["sdf","234"],//机构联系人
			"pubNo|1": ["123"], //公募客户编号，空代表未开户
			"mergeStatus|1": ["0"] , //公私募账号是否合并，0是，1否
			"ticket": ['SDER'], //私募跳转公募信息解密口令
			"riskRank": "5", //公募客户风险等级
			"isPerfect" : '0', //私募基本信息是否完善0否1是
			"customerNo":"123456",//统一客户编号
			"investFavour": "0", //投资者分类【参照备注：空表示未做投资者分类 0：普通投资者 1：专业投资者 2：当然专业投资者
			"newComer": "0", //是否新手账号  0否 1是
			"age":"18",//年龄
			"knowledgeQuestionStatus" : '1' ,//0 未通过 1 通过
			'accreditedInvestor|1':["0","2"],//合格投资者状态  是否合格投资者 空-未做； 0-未通过；1-已通过； 2-已过期
			'accreditedInvestorValiddate':'2019-09-09',//合格投资者有效期
			"pu2prState" :'2' , //公转私签署状态 0未签约 1待签约 2已签约 3已拒绝
			"loginPhoneEncrypt":"" ,//Aes加密注册手机号
			"linkPhoneEncrypt":"",//Aes加密联系人手机号
	}
});



module.exports = data;