/*
	公募监管账户
*/

// 使用 Mock
var Mock = require('mockjs');

//注册
var account = Mock.mock({ 
	"hmac": "hmac", 
	"status": "0", 
	"code": "CS0000", 
	"msg": "success", 
	"data|1": [{
		"id":1, //主键
		"title":"恒天明泽资金归集账户1",//主题
		"accountName":"北京恒天明泽基金销售有限公司公募代销账户",//户名
		"bankAccount":"639688800",//账号
		"bankAccountName":"中国民生银行北京西单支行",//开户行
		"bankNo":"305100001303",//行号
		"remarks":"汇款人银行账户信息必须与购买时所选银行账户信息一致，汇款用途处可填写“认购、申购XX基金”，也可不填。"//备注信息（注意）
	},
	{
		"id":2, //主键
		"title":"恒天明泽资金归集账户2",//主题
		"accountName":"北京恒天明泽基金销售有限公司公募代销账户",//户名
		"bankAccount":"639688800",//账号
		"bankAccountName":"中国民生银行北京西单支行",//开户行
		"bankNo":"305100001303",//行号
		"remarks":"汇款人银行账户信息必须与购买时所选银行账户信息一致，汇款用途处可填写“认购、申购XX基金”，也可不填。"//备注信息（注意）
	},
	{
		"id":3, //主键
		"title":"恒天明泽资金归集账户3",//主题
		"accountName":"北京恒天明泽基金销售有限公司公募代销账户",//户名
		"bankAccount":"639688800",//账号
		"bankAccountName":"中国民生银行北京西单支行",//开户行
		"bankNo":"305100001303",//行号
		"remarks":"汇款人银行账户信息必须与购买时所选银行账户信息一致，汇款用途处可填写“认购、申购XX基金”，也可不填。"//备注信息（注意）
	},


	]
});

//把生成的假数据当做模块输出
//module.exports = data;

//根据传参数的不同进行处理

module.exports = account;

