/*
	产品详情 净值走势图
 */

// 使用 Mock
var Mock = require('mockjs');


//这里直接返回的就是JSON格式
var financial = Mock.mock({
    "hmac": "hmac",
    "status": 0,
    "code": "FP0001",
    "msg": "处理成功！",
    'data|10':[{
         "fundType": "12334",// 基金类型代码（参照invTypCom）
         "trdDt|1": ["2017-02-13","2017-02-17","2017-03-13","2017-02-15","2017-06-17"],// 交易日期
         "unitNav|1": ["1.2300", '2.22', '5.67','9.66','2.44','0.11','10.22'],// 份额净值
         "accuUnitNav|1": ["1.2300", '2.22', '5.67','9.66','2.44','0.11','10.22'],// 份额累计净值
         "dayChgRat|1": ["1.2300", '2.22', '5.67','9.66','2.44','0.11','10.22'],// 日涨跌幅（%）
         "annYldRat|1": ["1.2300", '2.22', '5.67','9.66','2.44','0.11','10.22'],// 最近7日折算年收益率
         "unitYld|1": ["1.2300", '2.22', '5.67','9.66','2.44','0.11','10.22'] //每万份基金单位当日收益

  	}]
    // 'data|10':[]
  });


module.exports=financial;