/*

预约明细数据模拟

*/

// 使用 Mock
var Mock = require('mockjs');

//开始造假数据…………………………………………………………………………………………………………………………………………………………
//共10个

//1. 预约明细
var appDetail = Mock.mock({
  "hmac": "hmac",
  "status": 0,
  "code": "CS0000",
  "msg": "处理成功！",
  "data":{
        "pageList":[{
            "fundName":"恒天财富鼎龙精选6号证券投资基金",//产品名称
            "fundCode": "0000G2",//产品代码
            "orderBalance": "30000",//预约金额
            "orderTime":"2016-08-09", //预约日期
            "orderDesc|1":["排队中","已撤销","已过期","已确认","签约中","转投资意向","有项目转移","排队成功","排队不成功","复核通过","已签约","审核通过","到账中","已赎回","待确认"] ,//预约状态
            "brokerName":"赵中月",    //确认份额
            "isCancel|1": [1,2] //成立日期
        },
        {
            "fundName":"恒天财富鼎龙精选6号证券投资基金",//产品名称
            "fundCode": "0000G2",//产品代码
            "orderBalance": "30000",//预约金额
            "orderTime":"2016-08-09", //预约日期
            "orderDesc|1":["排队中","已撤销","已过期","已确认","签约中","转投资意向","有项目转移","排队成功","排队不成功","复核通过","已签约","审核通过","到账中","已赎回","待确认"] ,//预约状态
            "brokerName":"赵中月",    //确认份额
            "isCancel|1": [1,2] //成立日期
        },
        {
            "fundName":"恒天财富鼎龙精选6号证券投资基金",//产品名称
            "fundCode": "0000G2",//产品代码
            "orderBalance": "30000",//预约金额
            "orderTime":"2016-08-09", //预约日期
            "orderDesc|1":["排队中","已撤销","已过期","已确认","签约中","转投资意向","有项目转移","排队成功","排队不成功","复核通过","已签约","审核通过","到账中","已赎回","待确认"] ,//预约状态
            "brokerName":"赵中月",    //确认份额
            "isCancel|1": [1,2] //成立日期
        },
        {
            "fundName":"恒天财富鼎龙精选6号证券投资基金",//产品名称
            "fundCode": "0000G2",//产品代码
            "orderBalance": "30000",//预约金额
            "orderTime":"2016-08-09", //预约日期
            "orderDesc|1":["排队中","已撤销","已过期","已确认","签约中","转投资意向","有项目转移","排队成功","排队不成功","复核通过","已签约","审核通过","到账中","已赎回","待确认"] ,//预约状态
            "brokerName":"赵中月",    //确认份额
            "isCancel|1": [1,2] //成立日期
        }],
        "pageItems": {
            "totalCount": "100",//总记录数
            "totalPages": "1"//总页数
        }
    }

});

//把生成的假数据当做模块输出
//module.exports = data;

//根据传参数的不同进行处理

module.exports = appDetail;