/*
  查询客户预约所需条件接口
* conditionJump  相关跳转
	1 认证中心
	2 信息补全
	3 专项风测
	4 投资者分类申请
	5 投资者分类结果页
	6 合格投资者申请
	7 合格投资者结果页 
	8 信息查看（修改证件有效期） 
	9 普通风测
	10 上传证件（V4.4.0新增-跳到上传身份证页面）
	11 进身份证上传
	12 进人脸识别
	13a 进线下申请状态-视频双录
	13b 进线下申请状态-影像采集
	14 进视频双录状态
* isPopup 是否弹框
    售前告知书
		空：不弹框
		19：65岁以上售前告知书
		20：65岁以下售前告知书
		10：金服售前告知书（查不到年龄）
	风险测评是否弹窗
		空：不弹框
		1：产品期限不符
*/

// 使用 Mock
var Mock = require('mockjs');

var data=Mock.mock({
	"hmac": "hmac", 
	"status": "0000", 
	"code": "CS0000", 
	"message": "处理成功！", 
	"data":[  
		{
		"conditionType": "1", // 财富账户
		"show": "0", // 一键认证弹框中财富账户类目是否展示 0否1是
		"statusDesc": "未实名", // 状态描述
		"isSatisfied": "1", //0 （开启策略限制并不满足） 1 （未开启策略限制或开启策略限制并满足）
		"conditionJump": "1", //相关跳转
		"isPopup": "0", //是否弹框
		},{
		"conditionType": "2", // 风险测评【包含普通，专项】
		"show": "0", // 一键认证弹框中风险测评类目是否展示 0否1是
		"statusDesc": "风测已过期", //状态描述
		"isSatisfied": "1", //0 （开启策略限制并不满足） 1 （未开启策略限制或开启策略限制并满足）
		"conditionJump": "2", //相关跳转
		"isPopup": "0", //是否弹框
		},{
		"conditionType": "3", // 完善基本信息
		"show": "0",// 一键认证弹框中完善基本信息类目是否展示 0否1是
		"statusDesc": "信息未完善",//状态描述
		"isSatisfied": "1",//0 （开启策略限制并不满足） 1 （未开启策略限制或开启策略限制并满足）
		"conditionJump": "3",//相关跳转
		"isPopup": "19",//是否弹框
		},{
		"conditionType": "4",//投资者分类认证
		"show": "0",//一键认证弹框中投资者分类认证类目是否展示 0否1是
		"statusDesc": "未实名",//状态描述
		"isSatisfied": "1",//0 （开启策略限制并不满足） 1 （未开启策略限制或开启策略限制并满足）
		"conditionJump": "4",//相关跳转
		"isPopup": "0",//是否弹框
		},{
		"conditionType": "5",// 合格投资者认证
		"show": "0",//一键认证弹框中合格投资者认证类目是否展示 0否1是
		"statusDesc": "未实名",//状态描述
		"isSatisfied": "1",//0 （开启策略限制并不满足） 1 （未开启策略限制或开启策略限制并满足）
		"conditionJump": "5",//相关跳转
		"isPopup": "0",//是否弹框
		},{
		"conditionType": "6",// 项目期限
		"show": "0",// 没用
		"statusDesc": "未实名",//没用
		"isSatisfied": "1",//是否满足合投限制 【0.不满足 1.满足 2产品未开启限制策略】
		"conditionJump": "5",//相关跳转
		"isPopup": "0",//是否展示产品期限不符弹框 空 不弹框 1 产品期限不符
		}
	]
});

module.exports=data;
